nkpr_dict = {
    "Пропан": {
        "nkpr": 2.0,  # Нижний концентрационный предел (в % об.)
        "molar_mass": 44.096  # Молекулярная масса (г/моль)
    },
    "Метан": {
        "nkpr": 5.28,  # Нижний концентрационный предел (в % об.)
        "molar_mass": 16.04  # Молекулярная масса (г/моль)
    },
    "Нефть (средняя)": {
        "nkpr": 1.6,  # Нижний концентрационный предел (в % об.)
        "molar_mass": 51  # Молекулярная масса (г/моль) - средняя величина
    },
    "Дизельное топливо": {
        "nkpr": 1.4,  # Нижний концентрационный предел (в % об.)
        "molar_mass": 210  # Молекулярная масса (г/моль) - средняя величина
    }
}